redis_benchmark/test/withPolicy3_10000000.txt
====== GET ======
  10000000 requests completed in 5.60 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 51.967 milliseconds (cumulative count 1000)
50.000% <= 326.143 milliseconds (cumulative count 5003000)
75.000% <= 377.599 milliseconds (cumulative count 7501000)
87.500% <= 468.735 milliseconds (cumulative count 8755000)
93.750% <= 488.447 milliseconds (cumulative count 9381000)
96.875% <= 511.999 milliseconds (cumulative count 9689000)
98.438% <= 551.423 milliseconds (cumulative count 9849000)
99.219% <= 559.615 milliseconds (cumulative count 9922000)
99.609% <= 563.711 milliseconds (cumulative count 9963000)
99.805% <= 565.247 milliseconds (cumulative count 9982000)
99.902% <= 566.271 milliseconds (cumulative count 9994000)
99.951% <= 566.783 milliseconds (cumulative count 9999000)
99.994% <= 567.807 milliseconds (cumulative count 10000000)
100.000% <= 567.807 milliseconds (cumulative count 10000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 52.127 milliseconds (cumulative count 2000)
0.130% <= 53.119 milliseconds (cumulative count 13000)
0.280% <= 54.111 milliseconds (cumulative count 28000)
0.430% <= 55.103 milliseconds (cumulative count 43000)
0.580% <= 56.127 milliseconds (cumulative count 58000)
0.660% <= 57.119 milliseconds (cumulative count 66000)
0.670% <= 58.111 milliseconds (cumulative count 67000)
0.710% <= 60.127 milliseconds (cumulative count 71000)
0.830% <= 124.159 milliseconds (cumulative count 83000)
0.930% <= 125.119 milliseconds (cumulative count 93000)
0.980% <= 127.103 milliseconds (cumulative count 98000)
1.120% <= 128.127 milliseconds (cumulative count 112000)
1.190% <= 129.151 milliseconds (cumulative count 119000)
1.220% <= 130.111 milliseconds (cumulative count 122000)
1.240% <= 132.223 milliseconds (cumulative count 124000)
1.260% <= 133.119 milliseconds (cumulative count 126000)
1.330% <= 134.143 milliseconds (cumulative count 133000)
1.470% <= 135.167 milliseconds (cumulative count 147000)
1.610% <= 136.191 milliseconds (cumulative count 161000)
1.750% <= 137.215 milliseconds (cumulative count 175000)
1.760% <= 138.111 milliseconds (cumulative count 176000)
1.850% <= 139.135 milliseconds (cumulative count 185000)
1.960% <= 140.159 milliseconds (cumulative count 196000)
2.100% <= 141.183 milliseconds (cumulative count 210000)
2.210% <= 142.207 milliseconds (cumulative count 221000)
2.280% <= 143.103 milliseconds (cumulative count 228000)
2.320% <= 144.127 milliseconds (cumulative count 232000)
2.340% <= 146.175 milliseconds (cumulative count 234000)
2.450% <= 147.199 milliseconds (cumulative count 245000)
2.600% <= 148.223 milliseconds (cumulative count 260000)
2.680% <= 149.119 milliseconds (cumulative count 268000)
2.750% <= 150.143 milliseconds (cumulative count 275000)
2.820% <= 151.167 milliseconds (cumulative count 282000)
2.900% <= 152.191 milliseconds (cumulative count 290000)
2.960% <= 153.215 milliseconds (cumulative count 296000)
3.010% <= 154.111 milliseconds (cumulative count 301000)
3.130% <= 155.135 milliseconds (cumulative count 313000)
3.220% <= 156.159 milliseconds (cumulative count 322000)
3.240% <= 157.183 milliseconds (cumulative count 324000)
3.380% <= 158.207 milliseconds (cumulative count 338000)
3.440% <= 159.103 milliseconds (cumulative count 344000)
3.570% <= 160.127 milliseconds (cumulative count 357000)
3.710% <= 161.151 milliseconds (cumulative count 371000)
3.760% <= 162.175 milliseconds (cumulative count 376000)
3.770% <= 163.199 milliseconds (cumulative count 377000)
3.880% <= 164.223 milliseconds (cumulative count 388000)
4.000% <= 165.119 milliseconds (cumulative count 400000)
4.090% <= 166.143 milliseconds (cumulative count 409000)
4.200% <= 167.167 milliseconds (cumulative count 420000)
4.310% <= 168.191 milliseconds (cumulative count 431000)
4.420% <= 169.215 milliseconds (cumulative count 442000)
4.550% <= 170.111 milliseconds (cumulative count 455000)
4.690% <= 171.135 milliseconds (cumulative count 469000)
4.910% <= 172.159 milliseconds (cumulative count 491000)
5.160% <= 173.183 milliseconds (cumulative count 516000)
5.320% <= 174.207 milliseconds (cumulative count 532000)
5.450% <= 175.103 milliseconds (cumulative count 545000)
5.540% <= 176.127 milliseconds (cumulative count 554000)
5.680% <= 177.151 milliseconds (cumulative count 568000)
5.920% <= 178.175 milliseconds (cumulative count 592000)
6.200% <= 179.199 milliseconds (cumulative count 620000)
6.380% <= 180.223 milliseconds (cumulative count 638000)
6.500% <= 181.119 milliseconds (cumulative count 650000)
6.620% <= 182.143 milliseconds (cumulative count 662000)
6.850% <= 183.167 milliseconds (cumulative count 685000)
7.050% <= 184.191 milliseconds (cumulative count 705000)
7.240% <= 185.215 milliseconds (cumulative count 724000)
7.510% <= 186.111 milliseconds (cumulative count 751000)
7.790% <= 187.135 milliseconds (cumulative count 779000)
8.060% <= 188.159 milliseconds (cumulative count 806000)
8.270% <= 189.183 milliseconds (cumulative count 827000)
8.520% <= 190.207 milliseconds (cumulative count 852000)
8.690% <= 191.103 milliseconds (cumulative count 869000)
8.820% <= 192.127 milliseconds (cumulative count 882000)
8.940% <= 193.151 milliseconds (cumulative count 894000)
9.280% <= 194.175 milliseconds (cumulative count 928000)
9.730% <= 195.199 milliseconds (cumulative count 973000)
10.210% <= 196.223 milliseconds (cumulative count 1021000)
10.530% <= 197.119 milliseconds (cumulative count 1053000)
10.970% <= 198.143 milliseconds (cumulative count 1097000)
11.560% <= 199.167 milliseconds (cumulative count 1156000)
11.900% <= 200.191 milliseconds (cumulative count 1190000)
12.360% <= 201.215 milliseconds (cumulative count 1236000)
12.640% <= 202.111 milliseconds (cumulative count 1264000)
12.890% <= 203.135 milliseconds (cumulative count 1289000)
13.300% <= 204.159 milliseconds (cumulative count 1330000)
13.980% <= 205.183 milliseconds (cumulative count 1398000)
14.700% <= 206.207 milliseconds (cumulative count 1470000)
15.200% <= 207.103 milliseconds (cumulative count 1520000)
15.660% <= 208.127 milliseconds (cumulative count 1566000)
16.170% <= 209.151 milliseconds (cumulative count 1617000)
16.610% <= 210.175 milliseconds (cumulative count 1661000)
16.950% <= 211.199 milliseconds (cumulative count 1695000)
17.320% <= 212.223 milliseconds (cumulative count 1732000)
17.710% <= 213.119 milliseconds (cumulative count 1771000)
18.110% <= 214.143 milliseconds (cumulative count 1811000)
18.570% <= 215.167 milliseconds (cumulative count 1857000)
19.050% <= 216.191 milliseconds (cumulative count 1905000)
19.590% <= 217.215 milliseconds (cumulative count 1959000)
20.030% <= 218.111 milliseconds (cumulative count 2003000)
20.490% <= 219.135 milliseconds (cumulative count 2049000)
20.840% <= 220.159 milliseconds (cumulative count 2084000)
21.320% <= 221.183 milliseconds (cumulative count 2132000)
21.990% <= 222.207 milliseconds (cumulative count 2199000)
22.550% <= 223.103 milliseconds (cumulative count 2255000)
23.430% <= 224.127 milliseconds (cumulative count 2343000)
24.130% <= 225.151 milliseconds (cumulative count 2413000)
24.760% <= 226.175 milliseconds (cumulative count 2476000)
25.570% <= 227.199 milliseconds (cumulative count 2557000)
26.460% <= 228.223 milliseconds (cumulative count 2646000)
27.210% <= 229.119 milliseconds (cumulative count 2721000)
27.760% <= 230.143 milliseconds (cumulative count 2776000)
28.450% <= 231.167 milliseconds (cumulative count 2845000)
29.160% <= 232.191 milliseconds (cumulative count 2916000)
29.930% <= 233.215 milliseconds (cumulative count 2993000)
30.690% <= 234.111 milliseconds (cumulative count 3069000)
31.450% <= 235.135 milliseconds (cumulative count 3145000)
31.960% <= 236.159 milliseconds (cumulative count 3196000)
32.410% <= 237.183 milliseconds (cumulative count 3241000)
32.770% <= 238.207 milliseconds (cumulative count 3277000)
33.090% <= 239.103 milliseconds (cumulative count 3309000)
33.400% <= 240.127 milliseconds (cumulative count 3340000)
33.540% <= 241.151 milliseconds (cumulative count 3354000)
33.740% <= 242.175 milliseconds (cumulative count 3374000)
34.150% <= 243.199 milliseconds (cumulative count 3415000)
34.550% <= 244.223 milliseconds (cumulative count 3455000)
34.860% <= 245.119 milliseconds (cumulative count 3486000)
35.260% <= 246.143 milliseconds (cumulative count 3526000)
35.750% <= 247.167 milliseconds (cumulative count 3575000)
36.190% <= 248.191 milliseconds (cumulative count 3619000)
36.520% <= 249.215 milliseconds (cumulative count 3652000)
36.590% <= 250.111 milliseconds (cumulative count 3659000)
36.770% <= 252.159 milliseconds (cumulative count 3677000)
37.060% <= 253.183 milliseconds (cumulative count 3706000)
37.220% <= 254.207 milliseconds (cumulative count 3722000)
37.350% <= 255.103 milliseconds (cumulative count 3735000)
37.490% <= 256.127 milliseconds (cumulative count 3749000)
37.610% <= 257.151 milliseconds (cumulative count 3761000)
37.700% <= 258.175 milliseconds (cumulative count 3770000)
37.810% <= 259.199 milliseconds (cumulative count 3781000)
37.960% <= 260.223 milliseconds (cumulative count 3796000)
38.220% <= 261.119 milliseconds (cumulative count 3822000)
38.510% <= 262.143 milliseconds (cumulative count 3851000)
38.780% <= 263.167 milliseconds (cumulative count 3878000)
39.120% <= 264.191 milliseconds (cumulative count 3912000)
39.470% <= 265.215 milliseconds (cumulative count 3947000)
39.750% <= 266.239 milliseconds (cumulative count 3975000)
39.900% <= 267.263 milliseconds (cumulative count 3990000)
40.150% <= 268.287 milliseconds (cumulative count 4015000)
40.410% <= 269.311 milliseconds (cumulative count 4041000)
40.580% <= 270.335 milliseconds (cumulative count 4058000)
40.690% <= 271.103 milliseconds (cumulative count 4069000)
40.820% <= 272.127 milliseconds (cumulative count 4082000)
40.870% <= 273.151 milliseconds (cumulative count 4087000)
40.970% <= 274.175 milliseconds (cumulative count 4097000)
41.110% <= 275.199 milliseconds (cumulative count 4111000)
41.280% <= 276.223 milliseconds (cumulative count 4128000)
41.510% <= 277.247 milliseconds (cumulative count 4151000)
41.680% <= 278.271 milliseconds (cumulative count 4168000)
41.770% <= 279.295 milliseconds (cumulative count 4177000)
41.910% <= 280.319 milliseconds (cumulative count 4191000)
42.060% <= 281.343 milliseconds (cumulative count 4206000)
42.170% <= 282.111 milliseconds (cumulative count 4217000)
42.180% <= 283.135 milliseconds (cumulative count 4218000)
42.200% <= 290.303 milliseconds (cumulative count 4220000)
42.350% <= 291.327 milliseconds (cumulative count 4235000)
42.500% <= 292.351 milliseconds (cumulative count 4250000)
42.610% <= 293.119 milliseconds (cumulative count 4261000)
42.670% <= 294.143 milliseconds (cumulative count 4267000)
42.680% <= 301.311 milliseconds (cumulative count 4268000)
42.810% <= 302.335 milliseconds (cumulative count 4281000)
43.000% <= 303.103 milliseconds (cumulative count 4300000)
43.190% <= 304.127 milliseconds (cumulative count 4319000)
43.500% <= 305.151 milliseconds (cumulative count 4350000)
43.830% <= 306.175 milliseconds (cumulative count 4383000)
44.090% <= 307.199 milliseconds (cumulative count 4409000)
44.100% <= 308.223 milliseconds (cumulative count 4410000)
44.220% <= 310.271 milliseconds (cumulative count 4422000)
44.510% <= 311.295 milliseconds (cumulative count 4451000)
44.770% <= 312.319 milliseconds (cumulative count 4477000)
44.910% <= 313.343 milliseconds (cumulative count 4491000)
45.040% <= 314.111 milliseconds (cumulative count 4504000)
45.190% <= 315.135 milliseconds (cumulative count 4519000)
45.460% <= 316.159 milliseconds (cumulative count 4546000)
45.920% <= 317.183 milliseconds (cumulative count 4592000)
46.580% <= 318.207 milliseconds (cumulative count 4658000)
47.250% <= 319.231 milliseconds (cumulative count 4725000)
47.830% <= 320.255 milliseconds (cumulative count 4783000)
48.460% <= 321.279 milliseconds (cumulative count 4846000)
48.900% <= 322.303 milliseconds (cumulative count 4890000)
49.180% <= 323.327 milliseconds (cumulative count 4918000)
49.490% <= 324.351 milliseconds (cumulative count 4949000)
49.620% <= 325.119 milliseconds (cumulative count 4962000)
50.030% <= 326.143 milliseconds (cumulative count 5003000)
50.540% <= 327.167 milliseconds (cumulative count 5054000)
51.040% <= 328.191 milliseconds (cumulative count 5104000)
51.600% <= 329.215 milliseconds (cumulative count 5160000)
52.650% <= 330.239 milliseconds (cumulative count 5265000)
53.910% <= 331.263 milliseconds (cumulative count 5391000)
54.500% <= 332.287 milliseconds (cumulative count 5450000)
55.050% <= 333.311 milliseconds (cumulative count 5505000)
55.740% <= 334.335 milliseconds (cumulative count 5574000)
56.070% <= 335.103 milliseconds (cumulative count 5607000)
56.620% <= 336.127 milliseconds (cumulative count 5662000)
56.970% <= 337.151 milliseconds (cumulative count 5697000)
57.440% <= 338.175 milliseconds (cumulative count 5744000)
57.800% <= 339.199 milliseconds (cumulative count 5780000)
58.170% <= 340.223 milliseconds (cumulative count 5817000)
58.550% <= 341.247 milliseconds (cumulative count 5855000)
58.970% <= 342.271 milliseconds (cumulative count 5897000)
59.510% <= 343.295 milliseconds (cumulative count 5951000)
60.050% <= 344.319 milliseconds (cumulative count 6005000)
60.710% <= 345.343 milliseconds (cumulative count 6071000)
61.050% <= 346.111 milliseconds (cumulative count 6105000)
61.760% <= 347.135 milliseconds (cumulative count 6176000)
62.510% <= 348.159 milliseconds (cumulative count 6251000)
63.190% <= 349.183 milliseconds (cumulative count 6319000)
63.660% <= 350.207 milliseconds (cumulative count 6366000)
64.010% <= 351.231 milliseconds (cumulative count 6401000)
64.410% <= 352.255 milliseconds (cumulative count 6441000)
64.980% <= 353.279 milliseconds (cumulative count 6498000)
65.530% <= 354.303 milliseconds (cumulative count 6553000)
65.960% <= 355.327 milliseconds (cumulative count 6596000)
66.280% <= 356.351 milliseconds (cumulative count 6628000)
66.660% <= 357.119 milliseconds (cumulative count 6666000)
67.010% <= 358.143 milliseconds (cumulative count 6701000)
67.450% <= 359.167 milliseconds (cumulative count 6745000)
67.820% <= 360.191 milliseconds (cumulative count 6782000)
67.970% <= 361.215 milliseconds (cumulative count 6797000)
68.380% <= 362.239 milliseconds (cumulative count 6838000)
69.030% <= 363.263 milliseconds (cumulative count 6903000)
69.720% <= 364.287 milliseconds (cumulative count 6972000)
70.380% <= 365.311 milliseconds (cumulative count 7038000)
70.730% <= 366.335 milliseconds (cumulative count 7073000)
71.060% <= 367.103 milliseconds (cumulative count 7106000)
71.440% <= 368.127 milliseconds (cumulative count 7144000)
71.920% <= 369.151 milliseconds (cumulative count 7192000)
72.420% <= 370.175 milliseconds (cumulative count 7242000)
72.980% <= 371.199 milliseconds (cumulative count 7298000)
73.400% <= 372.223 milliseconds (cumulative count 7340000)
73.910% <= 373.247 milliseconds (cumulative count 7391000)
74.070% <= 374.271 milliseconds (cumulative count 7407000)
74.320% <= 375.295 milliseconds (cumulative count 7432000)
74.610% <= 376.319 milliseconds (cumulative count 7461000)
74.920% <= 377.343 milliseconds (cumulative count 7492000)
75.170% <= 378.111 milliseconds (cumulative count 7517000)
75.400% <= 379.135 milliseconds (cumulative count 7540000)
75.610% <= 380.159 milliseconds (cumulative count 7561000)
75.850% <= 381.183 milliseconds (cumulative count 7585000)
76.090% <= 382.207 milliseconds (cumulative count 7609000)
76.300% <= 383.231 milliseconds (cumulative count 7630000)
76.500% <= 384.255 milliseconds (cumulative count 7650000)
76.820% <= 385.279 milliseconds (cumulative count 7682000)
77.060% <= 386.303 milliseconds (cumulative count 7706000)
77.160% <= 387.327 milliseconds (cumulative count 7716000)
77.400% <= 388.351 milliseconds (cumulative count 7740000)
77.610% <= 389.119 milliseconds (cumulative count 7761000)
77.830% <= 390.143 milliseconds (cumulative count 7783000)
77.960% <= 391.167 milliseconds (cumulative count 7796000)
78.120% <= 392.191 milliseconds (cumulative count 7812000)
78.150% <= 393.215 milliseconds (cumulative count 7815000)
78.290% <= 394.239 milliseconds (cumulative count 7829000)
78.320% <= 395.263 milliseconds (cumulative count 7832000)
78.450% <= 396.287 milliseconds (cumulative count 7845000)
78.600% <= 397.311 milliseconds (cumulative count 7860000)
78.720% <= 398.335 milliseconds (cumulative count 7872000)
78.910% <= 399.103 milliseconds (cumulative count 7891000)
79.170% <= 400.127 milliseconds (cumulative count 7917000)
79.430% <= 401.151 milliseconds (cumulative count 7943000)
79.600% <= 402.175 milliseconds (cumulative count 7960000)
79.690% <= 403.199 milliseconds (cumulative count 7969000)
79.870% <= 404.223 milliseconds (cumulative count 7987000)
80.020% <= 405.247 milliseconds (cumulative count 8002000)
80.300% <= 406.271 milliseconds (cumulative count 8030000)
80.550% <= 407.295 milliseconds (cumulative count 8055000)
80.720% <= 408.319 milliseconds (cumulative count 8072000)
80.860% <= 409.343 milliseconds (cumulative count 8086000)
80.950% <= 410.111 milliseconds (cumulative count 8095000)
81.090% <= 411.135 milliseconds (cumulative count 8109000)
81.120% <= 412.159 milliseconds (cumulative count 8112000)
81.130% <= 414.207 milliseconds (cumulative count 8113000)
81.170% <= 434.175 milliseconds (cumulative count 8117000)
81.230% <= 435.199 milliseconds (cumulative count 8123000)
81.260% <= 436.223 milliseconds (cumulative count 8126000)
81.400% <= 437.247 milliseconds (cumulative count 8140000)
81.590% <= 438.271 milliseconds (cumulative count 8159000)
81.680% <= 439.295 milliseconds (cumulative count 8168000)
81.690% <= 440.319 milliseconds (cumulative count 8169000)
81.820% <= 441.343 milliseconds (cumulative count 8182000)
81.920% <= 442.111 milliseconds (cumulative count 8192000)
82.060% <= 443.135 milliseconds (cumulative count 8206000)
82.230% <= 444.159 milliseconds (cumulative count 8223000)
82.360% <= 445.183 milliseconds (cumulative count 8236000)
82.490% <= 446.207 milliseconds (cumulative count 8249000)
82.620% <= 447.231 milliseconds (cumulative count 8262000)
82.780% <= 448.255 milliseconds (cumulative count 8278000)
82.860% <= 449.279 milliseconds (cumulative count 8286000)
82.990% <= 450.303 milliseconds (cumulative count 8299000)
83.300% <= 451.327 milliseconds (cumulative count 8330000)
83.620% <= 452.351 milliseconds (cumulative count 8362000)
83.790% <= 453.119 milliseconds (cumulative count 8379000)
84.050% <= 454.143 milliseconds (cumulative count 8405000)
84.200% <= 456.191 milliseconds (cumulative count 8420000)
84.440% <= 457.215 milliseconds (cumulative count 8444000)
84.520% <= 458.239 milliseconds (cumulative count 8452000)
84.770% <= 459.263 milliseconds (cumulative count 8477000)
85.120% <= 460.287 milliseconds (cumulative count 8512000)
85.340% <= 461.311 milliseconds (cumulative count 8534000)
85.680% <= 462.335 milliseconds (cumulative count 8568000)
86.010% <= 463.103 milliseconds (cumulative count 8601000)
86.210% <= 464.127 milliseconds (cumulative count 8621000)
86.490% <= 465.151 milliseconds (cumulative count 8649000)
86.690% <= 466.175 milliseconds (cumulative count 8669000)
86.970% <= 467.199 milliseconds (cumulative count 8697000)
87.360% <= 468.223 milliseconds (cumulative count 8736000)
87.690% <= 469.247 milliseconds (cumulative count 8769000)
87.890% <= 470.271 milliseconds (cumulative count 8789000)
88.320% <= 471.295 milliseconds (cumulative count 8832000)
88.580% <= 472.319 milliseconds (cumulative count 8858000)
88.920% <= 473.343 milliseconds (cumulative count 8892000)
89.170% <= 474.111 milliseconds (cumulative count 8917000)
89.560% <= 475.135 milliseconds (cumulative count 8956000)
89.910% <= 476.159 milliseconds (cumulative count 8991000)
90.240% <= 477.183 milliseconds (cumulative count 9024000)
90.600% <= 478.207 milliseconds (cumulative count 9060000)
90.860% <= 479.231 milliseconds (cumulative count 9086000)
91.050% <= 480.255 milliseconds (cumulative count 9105000)
91.300% <= 481.279 milliseconds (cumulative count 9130000)
91.660% <= 482.303 milliseconds (cumulative count 9166000)
92.080% <= 483.327 milliseconds (cumulative count 9208000)
92.590% <= 484.351 milliseconds (cumulative count 9259000)
92.860% <= 485.119 milliseconds (cumulative count 9286000)
93.110% <= 486.143 milliseconds (cumulative count 9311000)
93.400% <= 487.167 milliseconds (cumulative count 9340000)
93.730% <= 488.191 milliseconds (cumulative count 9373000)
94.020% <= 489.215 milliseconds (cumulative count 9402000)
94.430% <= 490.239 milliseconds (cumulative count 9443000)
94.630% <= 491.263 milliseconds (cumulative count 9463000)
94.700% <= 492.287 milliseconds (cumulative count 9470000)
94.830% <= 493.311 milliseconds (cumulative count 9483000)
95.040% <= 494.335 milliseconds (cumulative count 9504000)
95.050% <= 495.103 milliseconds (cumulative count 9505000)
95.210% <= 496.127 milliseconds (cumulative count 9521000)
95.420% <= 497.151 milliseconds (cumulative count 9542000)
95.460% <= 498.175 milliseconds (cumulative count 9546000)
95.520% <= 499.199 milliseconds (cumulative count 9552000)
95.640% <= 500.223 milliseconds (cumulative count 9564000)
95.680% <= 501.247 milliseconds (cumulative count 9568000)
95.700% <= 502.271 milliseconds (cumulative count 9570000)
95.710% <= 503.295 milliseconds (cumulative count 9571000)
95.950% <= 504.319 milliseconds (cumulative count 9595000)
96.140% <= 505.343 milliseconds (cumulative count 9614000)
96.300% <= 506.111 milliseconds (cumulative count 9630000)
96.410% <= 507.135 milliseconds (cumulative count 9641000)
96.580% <= 508.159 milliseconds (cumulative count 9658000)
96.630% <= 509.183 milliseconds (cumulative count 9663000)
96.690% <= 510.207 milliseconds (cumulative count 9669000)
96.800% <= 511.231 milliseconds (cumulative count 9680000)
96.940% <= 512.255 milliseconds (cumulative count 9694000)
97.050% <= 513.279 milliseconds (cumulative count 9705000)
97.090% <= 514.303 milliseconds (cumulative count 9709000)
97.110% <= 515.327 milliseconds (cumulative count 9711000)
97.150% <= 516.351 milliseconds (cumulative count 9715000)
97.290% <= 518.143 milliseconds (cumulative count 9729000)
97.430% <= 519.167 milliseconds (cumulative count 9743000)
97.470% <= 520.191 milliseconds (cumulative count 9747000)
97.510% <= 542.207 milliseconds (cumulative count 9751000)
97.650% <= 543.231 milliseconds (cumulative count 9765000)
97.780% <= 544.255 milliseconds (cumulative count 9778000)
97.930% <= 545.279 milliseconds (cumulative count 9793000)
98.070% <= 546.303 milliseconds (cumulative count 9807000)
98.140% <= 547.327 milliseconds (cumulative count 9814000)
98.250% <= 549.375 milliseconds (cumulative count 9825000)
98.380% <= 550.399 milliseconds (cumulative count 9838000)
98.490% <= 551.423 milliseconds (cumulative count 9849000)
98.580% <= 552.447 milliseconds (cumulative count 9858000)
98.710% <= 553.471 milliseconds (cumulative count 9871000)
98.850% <= 554.495 milliseconds (cumulative count 9885000)
98.890% <= 555.519 milliseconds (cumulative count 9889000)
98.950% <= 556.543 milliseconds (cumulative count 9895000)
99.000% <= 557.567 milliseconds (cumulative count 9900000)
99.070% <= 558.591 milliseconds (cumulative count 9907000)
99.140% <= 559.103 milliseconds (cumulative count 9914000)
99.280% <= 560.127 milliseconds (cumulative count 9928000)
99.370% <= 561.151 milliseconds (cumulative count 9937000)
99.430% <= 562.175 milliseconds (cumulative count 9943000)
99.580% <= 563.199 milliseconds (cumulative count 9958000)
99.700% <= 564.223 milliseconds (cumulative count 9970000)
99.820% <= 565.247 milliseconds (cumulative count 9982000)
99.940% <= 566.271 milliseconds (cumulative count 9994000)
99.990% <= 567.295 milliseconds (cumulative count 9999000)
100.000% <= 568.319 milliseconds (cumulative count 10000000)

Summary:
  throughput summary: 1785714.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      317.772    51.936   326.143   494.079   557.055   567.807